anthropic.claude-code
aos.gostmortem-table
augment.vscode-augment
catppuccin.catppuccin-vsc-icons
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
golang.go
hashicorp.terraform
k4ustu3h.theme-jamt
mechatroner.rainbow-csv
ms-vscode.makefile-tools
patriciodiaz.go-struct-analyzer
rust-lang.rust-analyzer
sainnhe.gruvbox-material
shivamkumar.go-extras
sst-dev.opencode
udon.grub-theme-syntax-highlighter
